skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) p_Pckt)->data;

  switch (p_event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      p_disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) p_event_pckt->data;

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */

      /* Record 4, the second half. Reasons worth knowing by heart: 0x08
       * supervision timeout (walked out of range / powered off), 0x13 remote
       * user terminated, 0x16 local host terminated, 0x3D MIC failure and 0x05
       * authentication failure — the last two are what a broken bond looks like
       * from the link layer, as against a peer that was simply never let in. */
      FS_BleDiag_Log("DISC handle=0x%04X reason=0x%02X peer=%s status=0x%02X",
          (unsigned) p_disconnection_complete_event->Connection_Handle,
          (unsigned) p_disconnection_complete_event->Reason,
          (p_disconnection_complete_event->Connection_Handle
              == BleApplicationContext.connectionHandleEndDevice1) ? "engo" :
          (p_disconnection_complete_event->Connection_Handle
              == BleApplicationContext.connectionHandleCentral) ? "phone" : "other",
          (unsigned) p_disconnection_complete_event->Status);

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.connectionHandleEndDevice1)
      {
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF END DEVICE 1 \n\r");
        BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
        BleApplicationContext.connectionHandleEndDevice1 = 0xFFFF;

        /* Reason per BT spec: 0x08 supervision timeout (out of range/powered
         * off), 0x13 remote terminated, 0x16 local terminated (self-heal). */
        FS_Log_WriteEventAsync("ENGO disconnected: reason 0x%02X",
                               p_disconnection_complete_event->Reason);

        /* Reset GATT client and app FSM, then restart discovery */
        FS_ActiveLook_Client_OnDisconnect();
        FS_ActiveLook_OnDisconnect();
        UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
      }

      if (p_disconnection_complete_event->Connection_Handle == BleApplicationContext.connectionHandleCentral)
      {
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF SMART PHONE \n\r");
        BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_IDLE;
        BleApplicationContext.connectionHandleCentral = 0xFFFF;

        if (FS_State_Get()->enable_ble)
        {
          /* restart advertising */
          FS_Adv_Request(APP_BLE_FAST_ADV);
        }

        HandleNotification.Custom_Evt_Opcode = CUSTOM_DISCON_HANDLE_EVT;
        HandleNotification.ConnectionHandle = 0xFFFF;
        Custom_APP_Notification(&HandleNotification);
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      p_meta_evt = (evt_le_meta_event*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (p_meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE:
#if (CFG_DEBUG_APP_TRACE != 0)
          p_connection_update_complete_event = (hci_le_connection_update_complete_event_rp0 *) p_meta_evt->data;
          APP_DBG_MSG(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          APP_DBG_MSG("     - Connection Interval:   %.2f ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n\r",
                       p_connection_update_complete_event->Conn_Interval*1.25,
                       p_connection_update_complete_event->Conn_Latency,
                       p_connection_update_complete_event->Supervision_Timeout*10);
#endif /* CFG_DEBUG_APP_TRACE != 0 */

          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
          p_enhanced_connection_complete_event = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */

          connection_handle = p_enhanced_connection_complete_event->Connection_Handle;
          role = p_enhanced_connection_complete_event->Role;

#if FS_BLE_DIAG
          /* Record 4, the first half — and the single most informative line in
           * the file for this bug. role=1 is us as PERIPHERAL, i.e. a phone or
           * the Mac got past the whitelist filter. peer_type 0x00/0x01 is a plain
           * public/random identity; 0x02/0x03 mean the controller RESOLVED the
           * peer's private address against the resolving list, so peer_addr is
           * the identity behind it and peer_rpa is what was actually on the air.
           * A phone that only ever gets in after a double-press should show
           * peer_type 0x01 with a peer_rpa-shaped address here — that is the
           * signature of "known device, unresolvable identity". */
          {
            char idStr[18], rpaStr[18];
            FS_BleDiag_FormatAddr(idStr, sizeof(idStr),
                p_enhanced_connection_complete_event->Peer_Address);
            FS_BleDiag_FormatAddr(rpaStr, sizeof(rpaStr),
                p_enhanced_connection_complete_event->Peer_Resolvable_Private_Address);
            FS_BleDiag_Log("CONN st=0x%02X role=%u handle=0x%04X ptype=%u paddr=%s",
                (unsigned) p_enhanced_connection_complete_event->Status,
                (unsigned) role, (unsigned) connection_handle,
                (unsigned) p_enhanced_connection_complete_event->Peer_Address_Type,
                idStr);
            FS_BleDiag_Log("CONN handle=0x%04X peer_rpa=%s int=%u to=%u",
                (unsigned) connection_handle, rpaStr,
                (unsigned) p_enhanced_connection_complete_event->Conn_Interval,
                (unsigned) p_enhanced_connection_complete_event->Supervision_Timeout);
          }
#endif

          if (role == 0x00)
          { /* ROLE CENTRAL */
        	  APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 1\n\r");
        	  BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_CONNECTED;
        	  BleApplicationContext.connectionHandleEndDevice1 = connection_handle;
        	  FS_ActiveLook_Client_StartDiscovery(connection_handle);
          }
          else
          {
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH SMART PHONE\n\r");
            BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleCentral = connection_handle;
            HandleNotification.Custom_Evt_Opcode = CUSTOM_CONN_HANDLE_EVT;
            HandleNotification.ConnectionHandle = connection_handle;
            Custom_APP_Notification(&HandleNotification);

