skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
  if (total == 0)
  {
    APP_DBG_MSG("No previous bonded devices\r\n");
  }

  /* Record 2's answer in one line: n=0 with the whitelist filter armed means
   * nothing on earth can connect without a double-press. */
  FS_BleDiag_Log("WL get_bonded=0x%02X n=%u", (unsigned) ret, (unsigned) total);

  for (uint8_t k = 0; k < total; k++)
  {
    // Log for visibility
    APP_DBG_MSG("Bonded %u/%u - %s %02X:%02X:%02X:%02X:%02X:%02X\r\n",
                k + 1, total,
                devices[k].Address_Type == 0 ? "Public" : "Random",
                devices[k].Address[5], devices[k].Address[4], devices[k].Address[3],
                devices[k].Address[2], devices[k].Address[1], devices[k].Address[0]);

#if FS_BLE_DIAG
    /* Address TYPE matters as much as the address: the identity the controller
     * stored has to be the identity the peer presents behind its resolvable
     * private address, and a public/random mix-up resolves to nothing. */
    FS_BleDiag_FormatAddr(addrStr, sizeof(addrStr), devices[k].Address);
    FS_BleDiag_Log("BOND %u/%u type=%u addr=%s",
        (unsigned) (k + 1), (unsigned) total,
        (unsigned) devices[k].Address_Type, addrStr);
#endif

    rl_entries[k].Peer_Identity_Address_Type = devices[k].Address_Type;
    memcpy(rl_entries[k].Peer_Identity_Address, devices[k].Address, 6);
  }

  // 3) Add bonded identities to resolving list (PM0271 5.3.1 step 5)
  ret = aci_gap_add_devices_to_resolving_list(total, rl_entries, 1);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_add_devices_to_resolving_list fail %x\r\n", ret);
    FS_BleDiag_Log("RL add_devices=0x%02X n=%u FAILED", (unsigned) ret, (unsigned) total);
    return -1;
  }

  APP_DBG_MSG("Resolving List populated with %u bonded device(s)\r\n", total);
  FS_BleDiag_Log("RL add_devices=0x%02X n=%u", (unsigned) ret, (unsigned) total);
  return (int8_t)total;
}

/**
 * @brief  Scan Request
 * @param  None
 * @retval None
 */
static void Scan_Request(void)
{
  /* USER CODE BEGIN Scan_Request_1 */

  /* USER CODE END Scan_Request_1 */
  tBleStatus result;

  if (BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED)
  {
    /* USER CODE BEGIN APP_BLE_CONNECTED */
    BleApplicationContext.EndDevice1Found = 0x00;
    /* USER CODE END APP_BLE_CONNECTED */
    result = aci_gap_start_general_discovery_proc(SCAN_P,
                                                  SCAN_L,
                                                  CFG_BLE_ADDRESS_TYPE,
                                                  1);
    if (result == BLE_STATUS_SUCCESS)
    {
    /* USER CODE BEGIN BLE_SCAN_SUCCESS */

    /* USER CODE END BLE_SCAN_SUCCESS */
      APP_DBG_MSG(" \r\n\r** START GENERAL DISCOVERY (SCAN) **  \r\n\r");
    }
    else
    {
    /* USER CODE BEGIN BLE_SCAN_FAILED */

    /* USER CODE END BLE_SCAN_FAILED */
      APP_DBG_MSG("-- BLE_App_Start_Limited_Disc_Req, Failed %02x \r\n\r", result);
    }
  }
  /* USER CODE BEGIN Scan_Request_2 */

  /* USER CODE END Scan_Request_2 */

  return;
}

/**
 * @brief  Connection Establishement on SERVER 1
 * @param  None
 * @retval None
 */
static void Connect_Request(void)
{
  tBleStatus result;
  APP_DBG_MSG("\r\n\r** CREATE CONNECTION TO END DEVICE 1 **  \r\n\r");
  if (BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED &&
      BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTING)
  {
    /* USER CODE BEGIN APP_BLE_CONNECTED_SUCCESS_END_DEVICE_1 */

    /* USER CODE END APP_BLE_CONNECTED_SUCCESS_END_DEVICE_1 */
    result = aci_gap_create_connection(SCAN_P,
                                       SCAN_L,
                                       P2P_SERVER1_ADDR_TYPE,
                                       P2P_SERVER1_BDADDR,
                                       CFG_BLE_ADDRESS_TYPE,
                                       0x000C,   /* conn interval min = 15 ms (ActiveLook prefers 15-30) */
                                       0x0018,   /* conn interval max = 30 ms */
                                       0,
                                       SUPERV_TIMEOUT,
                                       CONN_L1,
                                       CONN_L2);

    if (result == BLE_STATUS_SUCCESS)
    {
      /* USER CODE BEGIN BLE_STATUS_END_DEVICE_1_SUCCESS */

      /* USER CODE END BLE_STATUS_END_DEVICE_1_SUCCESS */
      BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_CONNECTING;
      APP_DBG_MSG("==> Connect_Request Succeeded \n\r");
    }
    else
    {
      /* USER CODE BEGIN BLE_STATUS_END_DEVICE_1_FAILED */

      /* USER CODE END BLE_STATUS_END_DEVICE_1_FAILED */
      BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
      APP_DBG_MSG("==> Connect_Request Failed, re-scheduling scan\n\r");
      /* Re-arm scanning so we retry when glasses become available */
      UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
    }
  }

  return;
}

/**
 * @brief  Disconnect on SERVER 1
 * @param  None
 * @retval None
 */
static void Disconnect_Request(void)
{
  tBleStatus result;
  uint16_t connection_handle = BleApplicationContext.connectionHandleEndDevice1;

  APP_DBG_MSG("\r\n\r** DISCONNECT FROM END DEVICE 1 **  \r\n\r");
  if (BleApplicationContext.EndDevice_Connection_Status[0] == APP_BLE_CONNECTED)
  {
    result = aci_gap_terminate(connection_handle, 0x13);
    if (result == BLE_STATUS_SUCCESS)
    {
      BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
      APP_DBG_MSG("Disconnection request sent successfully.\n");
    }
    else
    {
      BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_IDLE;
      APP_DBG_MSG("Failed to send disconnection request. Error: 0x%02X\n", result);
    }
  }
}

/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* p_Data)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);

  return;
}

